tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

defaults "write com.apple.finder AppleShowAllFiles -bool true"
defaults "write NSGlobalDomain AppleShowAllExtensions -bool true"

brew "zsh"
brew "git"
brew "wget"
brew "tmux"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "exa"
brew "bat"
brew "htop"
brew "fd"
brew "gnupg"
brew "jq"
brew "the_silver_searcher"
brew "python"
brew "node"
brew "yarn"
brew "go"
brew "rust"
brew "lua"
brew "gcc"
brew "openssl"
brew "tree"

cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "spotify"
cask "slack"
cask "zoom"
cask "notion"
cask "font-meslo-lg-nerd-font"

# Oh My Zsh & Powerlevel10k
git_clone "https://github.com/ohmyzsh/ohmyzsh.git" "$HOME/.oh-my-zsh"
git_clone "https://github.com/romkatv/powerlevel10k.git" "$HOME/.oh-my-zsh/custom/themes/powerlevel10k"

# Plugins
mkdir -p "$HOME/.oh-my-zsh/custom/plugins"
git_clone "https://github.com/zsh-users/zsh-autosuggestions" "$HOME/.oh-my-zsh/custom/plugins/zsh-autosuggestions"
git_clone "https://github.com/zsh-users/zsh-syntax-highlighting.git" "$HOME/.oh-my-zsh/custom/plugins/zsh-syntax-highlighting"
git_clone "https://github.com/zsh-users/zsh-completions" "$HOME/.oh-my-zsh/custom/plugins/zsh-completions"

echo "Installation complete! Restart your terminal."
